# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Fri Apr 10 02:24:09 AKDT 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design up_down_counter_8bit

create_clock -name "my_clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_load -pin_load 0.1 [get_ports {count[7]}]
set_load -pin_load 0.1 [get_ports {count[6]}]
set_load -pin_load 0.1 [get_ports {count[5]}]
set_load -pin_load 0.1 [get_ports {count[4]}]
set_load -pin_load 0.1 [get_ports {count[3]}]
set_load -pin_load 0.1 [get_ports {count[2]}]
set_load -pin_load 0.1 [get_ports {count[1]}]
set_load -pin_load 0.1 [get_ports {count[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports reset]
set_input_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports up_down]
set_output_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports {count[7]}]
set_output_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports {count[6]}]
set_output_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports {count[5]}]
set_output_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports {count[4]}]
set_output_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports {count[3]}]
set_output_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports {count[2]}]
set_output_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports {count[1]}]
set_output_delay -clock [get_clocks my_clk] -add_delay 2.0 [get_ports {count[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.1 [get_clocks my_clk]
set_clock_uncertainty -hold 0.1 [get_clocks my_clk]
